temp/frontend/controllers/RepliesController.php

    public function actionCreate($topic_id)
    {
        $model = new Replies();

        $topicsModel = Topics::findOne($topic_id);
---
SELECT * FROM `topics` WHERE `id`='2'