temp/frontend/controllers/SiteController.php

    public function actionClassroom($courseID){
        $this->layout = 'main_class';

        $model = Courses::findOne($courseID);
---
SELECT * FROM `courses` WHERE `id`='1'