temp/frontend/themes/freelancer/views/replies/create.php

SELECT * FROM `profile` WHERE `user_id`=1
---
?>

<div class="replies-create">
	<?php $topicCreator = Profile::findOne($topicsModel->user_id);?>

SELECT * FROM `replies` WHERE `topics_id`=2
---
    	</div>
    <hr>

    	<?php  $replies = Replies::find()->where(['topics_id' => $topicsModel->id])->all();

SELECT * FROM `profile` WHERE `user_id`=75
---
			<div class="bs-example" data-example-id="default-media">
				<div class="media">
					<div class="media-left">
						<a> <img data-holder-rendered="true" src="<?="img/avatar/" . Profile::findOne($reply->user_id)->avatar?>" style="width: 64px; height: 64px;" class="media-object" data-src="holder.js/64x64" alt="64x64"> </a>
					</div>
					<div class="media-body">

						<?php $postBy = Profile::findOne($reply->user_id); ?>

SELECT * FROM `sub_replies` WHERE `replies_id`=7
---
								<?php endif; ?>
							<?php endif; ?>

						<!-- reply of reply -->
						<?php $subComments = SubReplies::find()->where(['replies_id' => $reply->id])->all(); ?>