temp/frontend/themes/freelancer/views/site/classroom.php

SELECT * FROM `profile` WHERE `user_id`=1
---
use frontend\models\Profile;


$superUser = Profile::findOne(Yii::$app->user->identity->id)->status == 'teacher'? true : false;

SELECT * FROM `problems` WHERE `courses_id`=1
---
                        <tbody>

                            <?php
                            $problems = Problems::find()->where(['courses_id' => $model->id])->all();

SELECT * FROM `profile` WHERE `user_id`=1
---
                                            <button class="btn btn-default"><i class="fa fa-calendar"></i> กำหนดส่ง <?=$problem->duedate?></button>
                                        <?php endif; ?>

                                        <!-- render check/turnin button -->
                                        <?php if(Profile::findOne(Yii::$app->user->identity->id)->status == 'teacher'): // teacher?>

SELECT * FROM `topics` WHERE `courses_id`=1
---
                        <tbody>

                            <?php
                            $topics = Topics::find()->where(['courses_id' => $model->id])->all();

SELECT * FROM `profile` WHERE `user_id`=1
SELECT * FROM `user` WHERE `id`=1
SELECT * FROM `replies` WHERE `topics_id`=2
---
                            <tr>
                                <td>
                                    <p><b><a href=<?=Url::to(['replies/create', 'topic_id' => $topic->id])?>><?=$topic->topic?></a></b></p>
                                    <?php $postedBy = Profile::findOne($topic->user->id) ?>
                                    <p class="text-muted">โดย <b><?=$postedBy->firstname . "  " . $postedBy->lastname?></b> เมื่อ <b><?=$topic->date?></b></p>
                                </td>
                                <td>
                                	<?php $countReply = Replies::find()->where(['topics_id' => $topic->id])->all();?>

SELECT * FROM `coach` WHERE `courses_id`=1
---
            </div>

            <?php
            $coachs = Coach::find()->where(['courses_id' => $model->id])->all();