temp/frontend/themes/freelancer/views/site/classes.php

SELECT * FROM `profile` WHERE `user_id`=6
---


            <div class="form-group">
            <?php  if(Profile::findOne(Yii::$app->user->identity->id)->status == 'teacher'): ?>

SELECT * FROM `profile` WHERE `user_id`=6
SELECT * FROM `enrolment` WHERE `user_id`=6
---


            <?php // student view
            if(Profile::findOne(Yii::$app->user->identity->id)->status == 'student') : // Student view?>
            <div class="row">
                <?php $enrolments = Enrolment::find()->where(['user_id' =>Yii::$app->user->identity->id])->all();

SELECT * FROM `courses` WHERE (`created_by`=1) AND (`status`='active')
---

            <?php else: // teacher view?>
            <div class="row">
                <?php  $courses = Courses::find()->where(['created_by' => Yii::$app->user->identity->id, 'status' => "active"])->all();