temp/frontend/themes/freelancer/views/layouts/main.php

SELECT * FROM `profile` WHERE `user_id`=1
---
                    </li>
                    <?php else: ?>
                    <li class="page-scroll">
                        <!-- <a href=<?=Url::to(['/site/logout'])?> data-method="post"><?='Logout (' . Yii::$app->user->identity->username . ')'?></a> -->
                        <a href=<?=Url::to(['/site/logout'])?> data-method="post"><?='Logout ('.Profile::findOne(Yii::$app->user->identity->id)->firstname.')'?></a>