temp/frontend/themes/freelancer/views/layouts/main_class.php

                        <a href="#coaching">COACHING</a>
                    </li>
                    <li class="page-scroll">
                        <a href=<?=Url::to(['/site/logout'])?> data-method="post"><?='Logout ('.Profile::findOne(Yii::$app->user->identity->id)->firstname.')'?></a>
---
SELECT * FROM `profile` WHERE `user_id`=1